read_verilog test.v
synth -top test
abc -liberty mycells.lib;;
# dump
stat
