read_verilog test.v
prep
miter -equiv -make_assert -flatten test_a test_c miter
hierarchy -top miter
sat -verify -set-init-zero -tempinduct -prove-asserts
